In [1]:
import pandas as pd
import numpy as np

In [2]:
stat=pd.read_excel("/Users/bibekprasad/Documents/Data science webex/stats.xlsx")

In [3]:
stat

         Emp#  YearsOfExp  Salary in Rs.
0         1.0        10.0       126015.0
1         2.0         1.0        12598.0
2         3.0         8.0       100639.0
3         4.0        10.0       125351.0
4         5.0         2.0        25031.0
...       ...         ...            ...
1048570   NaN         NaN            NaN
1048571   NaN         NaN            NaN
1048572   NaN         NaN            NaN
1048573   NaN         NaN            NaN
1048574   NaN         6.2            NaN

[1048575 rows x 3 columns]

In [4]:
stat.mean()

Emp#                13.0
YearsOfExp           6.2
Salary in Rs.    77821.2
dtype: float64

In [5]:
stat.median()

Emp#                13.0
YearsOfExp           6.6
Salary in Rs.    87654.0
dtype: float64

In [6]:
stat.mode()

    Emp#  YearsOfExp  Salary in Rs.
0    1.0        10.0       100639.0
1    2.0         NaN            NaN
2    3.0         NaN            NaN
3    4.0         NaN            NaN
4    5.0         NaN            NaN
5    6.0         NaN            NaN
6    7.0         NaN            NaN
7    8.0         NaN            NaN
8    9.0         NaN            NaN
9   10.0         NaN            NaN
10  11.0         NaN            NaN
11  12.0         NaN            NaN
12  13.0         NaN            NaN
13  14.0         NaN            NaN
14  15.0         NaN            NaN
15  16.0         NaN            NaN
16  17.0         NaN            NaN
17  18.0         NaN            NaN
18  19.0         NaN            NaN
19  20.0         NaN            NaN
20  21.0         NaN            NaN
21  22.0         NaN            NaN
22  23.0         NaN            NaN
23  24.0         NaN            NaN
24  25.0         NaN            NaN

In [7]:
stat.std()

Emp#                 7.359801
YearsOfExp           3.111270
Salary in Rs.    39847.615281
dtype: float64

In [8]:
stat.var()

Emp#             5.416667e+01
YearsOfExp       9.680000e+00
Salary in Rs.    1.587832e+09
dtype: float64